## Plan Result (sendgrid-data-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/98390)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9
* Replace
  * aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 must be replaced
+/- resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      ~ created_date  = "2024-03-21T17:58:36Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:996905175585:1oyn6teaa0/" -> (known after apply)
      ~ id            = "gep1rd" -> (known after apply)
      ~ invoke_url    = "https://1oyn6teaa0.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "deployedAt"   = "1711043872987" -> null
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      ~ deployment_id         = "gep1rd" -> (known after apply)
        id                    = "ags-1oyn6teaa0-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  + apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_lambda_codedeploy_app_8D5BAA1D   = "SendGridData-Prod-ApiGateway-Lambda"
  + apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_lambda_codedeploy_group_1DA0D0EE = "SendGridData-Prod-ApiGateway-Lambda"
  + apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda_arn_02ED2922                                 = "arn:aws:lambda:us-east-1:996905175585:function:SendGridData-Prod-ApiGateway-Function"
  + apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda_function_name_5C62E143                       = "SendGridData-Prod-ApiGateway-Function"
  + apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda_version_arn_90AEC363                         = "arn:aws:lambda:us-east-1:996905175585:function:SendGridData-Prod-ApiGateway-Function:DEPLOYED"
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"37af4c34-acf4-49e9-851a-f8dea9d83a8d","JobName":"sendgrid-data_infrastructure_plan_prod","PRNumber":331,"Program":"tfcmt","SHA1":"91abaa5e48b7c39f40f45b30565614e9c461edd2","Target":"sendgrid-data-cdk","Vars":{}} -->